#### Terraform Plan 📝
```
module.catalog_eks.data.http.my_ip: Reading...
module.catalog_api_gateway.data.archive_file.lambda_zip: Reading...
module.catalog_bastion.data.http.my_ip: Reading...
module.catalog_api_gateway.data.archive_file.lambda_zip: Read complete after 0s [id=cd7b1dab33a483d16323afe7936f681294fbf7f5]
module.catalog_eks.data.aws_iam_role.node_role: Reading...
module.catalog_eks.data.aws_iam_role.lab_role: Reading...
module.catalog_database.data.aws_iam_role.lab_role: Reading...
module.catalog_eks.data.aws_caller_identity.current: Reading...
module.catalog_eks.data.aws_region.current: Reading...
module.catalog_eks.data.aws_partition.current: Reading...
module.catalog_eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.catalog_eks.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.catalog_bastion.data.aws_ami.amazon_linux: Reading...
module.catalog_api_gateway.data.aws_iam_role.lambda_role: Reading...
module.catalog_eks.data.aws_iam_role.cluster_role: Reading...
module.catalog_bastion.data.aws_iam_role.bastion_role: Reading...
module.catalog_eks.data.aws_caller_identity.current: Read complete after 0s [id=662621393411]
module.catalog_eks.data.http.my_ip: Read complete after 0s [id=https://checkip.amazonaws.com]
module.catalog_bastion.data.http.my_ip: Read complete after 0s [id=https://checkip.amazonaws.com]
module.catalog_eks.data.aws_iam_role.cluster_role: Read complete after 0s [id=c190909a4920103l13290273t1w662621-LabEksClusterRole-W1aKy5YEmwff]
module.catalog_bastion.data.aws_iam_role.bastion_role: Read complete after 0s [id=LabRole]
module.catalog_eks.data.aws_iam_role.lab_role: Read complete after 0s [id=LabRole]
module.catalog_api_gateway.data.aws_iam_role.lambda_role: Read complete after 0s [id=LabRole]
module.catalog_eks.data.aws_iam_role.node_role: Read complete after 0s [id=LabRole]
module.catalog_database.data.aws_iam_role.lab_role: Read complete after 0s [id=LabRole]
module.catalog_bastion.data.aws_ami.amazon_linux: Read complete after 0s [id=ami-03f9680ef0c07a3d1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "cluster" {
      + access_config                = (known after apply)
      + arn                          = (known after apply)
      + certificate_authority        = (known after apply)
      + cluster_id                   = (known after apply)
      + compute_config               = (known after apply)
      + control_plane_scaling_config = (known after apply)
      + created_at                   = (known after apply)
      + deletion_protection          = (known after apply)
      + enabled_cluster_log_types    = (known after apply)
      + endpoint                     = (known after apply)
      + id                           = (known after apply)
      + identity                     = (known after apply)
      + kubernetes_network_config    = (known after apply)
      + name                         = "catalog-eks-cluster"
      + outpost_config               = (known after apply)
      + platform_version             = (known after apply)
      + region                       = (known after apply)
      + remote_network_config        = (known after apply)
      + role_arn                     = (known after apply)
      + status                       = (known after apply)
      + storage_config               = (known after apply)
      + tags                         = (known after apply)
      + upgrade_policy               = (known after apply)
      + version                      = (known after apply)
      + vpc_config                   = (known after apply)
      + zonal_shift_config           = (known after apply)
    }

  # data.aws_eks_cluster_auth.auth will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "auth" {
      + id     = (known after apply)
      + name   = "catalog-eks-cluster"
      + region = (known after apply)
      + token  = (sensitive value)
    }

  # terraform_data.refresh_kubectl will be created
  + resource "terraform_data" "refresh_kubectl" {
      + id               = (known after apply)
      + input            = {
          + filename = "~/.kube/config"
        }
      + output           = (known after apply)
      + triggers_replace = (known after apply)
    }

  # module.catalog_api_gateway.aws_api_gateway_authorizer.lambda_auth will be created
  + resource "aws_api_gateway_authorizer" "lambda_auth" {
      + arn                              = (known after apply)
      + authorizer_result_ttl_in_seconds = 300
      + authorizer_uri                   = (known after apply)
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "catalog-lambda-authorizer"
      + region                           = "us-east-1"
      + rest_api_id                      = (known after apply)
      + type                             = "TOKEN"
    }

  # module.catalog_api_gateway.aws_api_gateway_deployment.api will be created
  + resource "aws_api_gateway_deployment" "api" {
      + created_date = (known after apply)
      + id           = (known after apply)
      + region       = "us-east-1"
      + rest_api_id  = (known after apply)
    }

  # module.catalog_api_gateway.aws_api_gateway_integration.proxy will be created
  + resource "aws_api_gateway_integration" "proxy" {
      + cache_namespace         = (known after apply)
      + connection_id           = (known after apply)
      + connection_type         = "VPC_LINK"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "ANY"
      + passthrough_behavior    = (known after apply)
      + region                  = "us-east-1"
      + request_parameters      = {
          + "integration.request.path.proxy" = "method.request.path.proxy"
        }
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "HTTP_PROXY"
      + uri                     = (known after apply)
    }

  # module.catalog_api_gateway.aws_api_gateway_method.proxy will be created
  + resource "aws_api_gateway_method" "proxy" {
      + api_key_required   = false
      + authorization      = "CUSTOM"
      + authorizer_id      = (known after apply)
      + http_method        = "ANY"
      + id                 = (known after apply)
      + region             = "us-east-1"
      + request_parameters = {
          + "method.request.path.proxy" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.catalog_api_gateway.aws_api_gateway_resource.proxy will be created
  + resource "aws_api_gateway_resource" "proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + region      = "us-east-1"
      + rest_api_id = (known after apply)
    }

  # module.catalog_api_gateway.aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "catalog-proxy-api"
      + policy                       = (known after apply)
      + region                       = "us-east-1"
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration (known after apply)
    }

  # module.catalog_api_gateway.aws_api_gateway_stage.api_stage will be created
  + resource "aws_api_gateway_stage" "api_stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + region        = "us-east-1"
      + rest_api_id   = (known after apply)
      + stage_name    = "stage"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # module.catalog_api_gateway.aws_api_gateway_vpc_link.catalog will be created
  + resource "aws_api_gateway_vpc_link" "catalog" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "catalog-vpc-link-catalog"
      + region      = "us-east-1"
      + tags        = {
          + "origin" = "tc-micro-service-4/modules/api_gateway/main.tf"
        }
      + tags_all    = {
          + "origin" = "tc-micro-service-4/modules/api_gateway/main.tf"
        }
      + target_arns = (known after apply)
    }

  # module.catalog_api_gateway.aws_lambda_function.authorizer will be created
  + resource "aws_lambda_function" "authorizer" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/api_gateway/scripts/lambda_authorizer.zip"
      + function_name                  = "api-authorizer-catalog"
      + handler                        = "lambda_authorizer.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::662621393411:role/LabRole"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "uxvXSVCF/ov4i6Jo7ukvA9SFezWcZfjuLi0hb4o6X+w="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.catalog_api_gateway.aws_lambda_permission.apigw_authorizer_invoke will be created
  + resource "aws_lambda_permission" "apigw_authorizer_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "api-authorizer-catalog"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvokeAuthorizer-catalog"
      + statement_id_prefix = (known after apply)
    }

  # module.catalog_api_gateway.aws_ssm_parameter.api_gateway_url will be created
  + resource "aws_ssm_parameter" "api_gateway_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "API Gateway URL for catalog service"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ordering-system/catalog/apigateway/url"
      + region         = "us-east-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.catalog_api_gateway.aws_ssm_parameter.valid_token_ssm will be created
  + resource "aws_ssm_parameter" "valid_token_ssm" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Valid token for integration"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ordering-system/catalog/apigateway/token"
      + region         = "us-east-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.catalog_api_gateway.random_password.valid_token will be created
  + resource "random_password" "valid_token" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.catalog_bastion.aws_iam_instance_profile.bastion_profile will be created
  + resource "aws_iam_instance_profile" "bastion_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "catalog-bastion-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "LabRole"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.catalog_bastion.aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-03f9680ef0c07a3d1"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = false
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "catalog-bastion-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = "terminate"
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "catalog_aws_key_pair"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "AutoDelete" = "true"
          + "Ephemeral"  = "true"
          + "Name"       = "catalog-bastion"
          + "origin"     = "tc-micro-service-4/modules/bastion/main.tf"
        }
      + tags_all                             = {
          + "AutoDelete" = "true"
          + "Ephemeral"  = "true"
          + "Name"       = "catalog-bastion"
          + "origin"     = "tc-micro-service-4/modules/bastion/main.tf"
        }
      + tenancy                              = (known after apply)
      + user_data                            = <<-EOT
            #!/bin/bash
            yum update -y
            yum install -y postgresql15
                
            # Install kubectl
            curl -O https://s3.us-west-2.amazonaws.com/amazon-eks/1.32.9/2025-11-13/bin/linux/amd64/kubectl
            chmod +x kubectl
            mv kubectl /usr/local/bin/
        EOT
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + primary_network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.catalog_bastion.aws_key_pair.bastion_key_pair will be created
  + resource "aws_key_pair" "bastion_key_pair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "catalog_aws_key_pair"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (sensitive value)
      + region          = "us-east-1"
      + tags_all        = (known after apply)
    }

  # module.catalog_bastion.aws_security_group.bastion_sg will be created
  + resource "aws_security_group" "bastion_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for catalog bastion host"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Access to database"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "52.154.20.199/32",
                ]
              + description      = "SSH access from allowed IPs"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "catalog-bastion-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"   = "catalog-bastion-sg"
          + "origin" = "tc-micro-service-4/modules/bastion/main.tf"
        }
      + tags_all               = {
          + "Name"   = "catalog-bastion-sg"
          + "origin" = "tc-micro-service-4/modules/bastion/main.tf"
        }
      + vpc_id                 = (known after apply)
    }

  # module.catalog_bastion.aws_ssm_parameter.bastion_public_ip will be created
  + resource "aws_ssm_parameter" "bastion_public_ip" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ordering-system/catalog/bastion/public_ip"
      + region         = "us-east-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.catalog_database.aws_db_instance.ordering_database will be created
  + resource "aws_db_instance" "ordering_database" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 1
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = "ordering_system"
      + db_subnet_group_name                  = "catalog-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "17.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "catalog-postgres"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "sun:04:00-sun:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + region                                = "us-east-1"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "origin" = "tc-micro-service-4/modules/database/main.tf"
        }
      + tags_all                              = {
          + "origin" = "tc-micro-service-4/modules/database/main.tf"
        }
      + timezone                              = (known after apply)
      + upgrade_rollout_order                 = (known after apply)
      + username                              = "ordering_admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.catalog_database.aws_security_group.db_sg will be created
  + resource "aws_security_group" "db_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for catalog database"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "catalog-db-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"   = "catalog-db-sg"
          + "origin" = "tc-micro-service-4/modules/database/network.tf"
        }
      + tags_all               = {
          + "Name"   = "catalog-db-sg"
          + "origin" = "tc-micro-service-4/modules/database/network.tf"
        }
      + vpc_id                 = (known after apply)
    }

  # module.catalog_database.aws_ssm_parameter.shared_database_host will be created
  + resource "aws_ssm_parameter" "shared_database_host" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Database host endpoint for cross-repository integration"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ordering-system/catalog/database/host"
      + overwrite      = true
      + region         = "us-east-1"
      + tags           = {
          + "origin" = "tc-micro-service-4/modules/database/secrets.tf"
        }
      + tags_all       = {
          + "origin" = "tc-micro-service-4/modules/database/secrets.tf"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.catalog_database.aws_ssm_parameter.shared_database_name will be created
  + resource "aws_ssm_parameter" "shared_database_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Database name for cross-repository integration"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ordering-system/catalog/database/name"
      + overwrite      = true
      + region         = "us-east-1"
      + tags           = {
          + "origin" = "tc-micro-service-4/modules/database/secrets.tf"
        }
      + tags_all       = {
          + "origin" = "tc-micro-service-4/modules/database/secrets.tf"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.catalog_database.aws_ssm_parameter.shared_database_password will be created
  + resource "aws_ssm_parameter" "shared_database_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Database password for cross-repository integration"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ordering-system/catalog/database/password"
      + overwrite      = true
      + region         = "us-east-1"
      + tags           = {
          + "origin" = "tc-micro-service-4/modules/database/secrets.tf"
        }
      + tags_all       = {
          + "origin" = "tc-micro-service-4/modules/database/secrets.tf"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.catalog_database.aws_ssm_parameter.shared_database_port will be created
  + resource "aws_ssm_parameter" "shared_database_port" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Database port for cross-repository integration"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ordering-system/catalog/database/port"
      + overwrite      = true
      + region         = "us-east-1"
      + tags           = {
          + "origin" = "tc-micro-service-4/modules/database/secrets.tf"
        }
      + tags_all       = {
          + "origin" = "tc-micro-service-4/modules/database/secrets.tf"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.catalog_database.aws_ssm_parameter.shared_database_username will be created
  + resource "aws_ssm_parameter" "shared_database_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Database username for cross-repository integration"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ordering-system/catalog/database/username"
      + overwrite      = true
      + region         = "us-east-1"
      + tags           = {
          + "origin" = "tc-micro-service-4/modules/database/secrets.tf"
        }
      + tags_all       = {
          + "origin" = "tc-micro-service-4/modules/database/secrets.tf"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.catalog_database.random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}|;:,.<>?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.catalog_eks.data.aws_eks_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "cluster" {
      + access_config                = (known after apply)
      + arn                          = (known after apply)
      + certificate_authority        = (known after apply)
      + cluster_id                   = (known after apply)
      + compute_config               = (known after apply)
      + control_plane_scaling_config = (known after apply)
      + created_at                   = (known after apply)
      + deletion_protection          = (known after apply)
      + enabled_cluster_log_types    = (known after apply)
      + endpoint                     = (known after apply)
      + id                           = (known after apply)
      + identity                     = (known after apply)
      + kubernetes_network_config    = (known after apply)
      + name                         = "catalog-eks-cluster"
      + outpost_config               = (known after apply)
      + platform_version             = (known after apply)
      + region                       = (known after apply)
      + remote_network_config        = (known after apply)
      + role_arn                     = (known after apply)
      + status                       = (known after apply)
      + storage_config               = (known after apply)
      + tags                         = (known after apply)
      + upgrade_policy               = (known after apply)
      + version                      = (known after apply)
      + vpc_config                   = (known after apply)
      + zonal_shift_config           = (known after apply)
    }

  # module.catalog_eks.aws_eks_access_entry.ordering_eks_access_entry will be created
  + resource "aws_eks_access_entry" "ordering_eks_access_entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "catalog-eks-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::662621393411:role/LabRole"
      + region            = "us-east-1"
      + tags              = {
          + "origin" = "tc-micro-service-4/modules/eks/access_entry.tf"
        }
      + tags_all          = {
          + "origin" = "tc-micro-service-4/modules/eks/access_entry.tf"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.catalog_eks.aws_eks_access_entry.ordering_eks_access_entry_voclabs will be created
  + resource "aws_eks_access_entry" "ordering_eks_access_entry_voclabs" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "catalog-eks-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::662621393411:role/voclabs"
      + region            = "us-east-1"
      + tags              = {
          + "origin" = "tc-micro-service-4/modules/eks/access_entry.tf"
        }
      + tags_all          = {
          + "origin" = "tc-micro-service-4/modules/eks/access_entry.tf"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.catalog_eks.aws_eks_access_policy_association.ordering_eks_access_policy_association will be created
  + resource "aws_eks_access_policy_association" "ordering_eks_access_policy_association" {
      + associated_at = (known after apply)
      + cluster_name  = "catalog-eks-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::662621393411:role/LabRole"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.catalog_eks.aws_eks_access_policy_association.ordering_eks_access_policy_association_voclabs will be created
  + resource "aws_eks_access_policy_association" "ordering_eks_access_policy_association_voclabs" {
      + associated_at = (known after apply)
      + cluster_name  = "catalog-eks-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::662621393411:role/voclabs"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.catalog_eks.aws_eks_cluster.ordering_eks_cluster will be created
  + resource "aws_eks_cluster" "ordering_eks_cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "catalog-eks-cluster"
      + platform_version              = (known after apply)
      + region                        = "us-east-1"
      + role_arn                      = "arn:aws:iam::662621393411:role/LabRole"
      + status                        = (known after apply)
      + tags                          = {
          + "origin" = "tc-micro-service-4/modules/eks/main.tf"
        }
      + tags_all                      = {
          + "origin" = "tc-micro-service-4/modules/eks/main.tf"
        }
      + version                       = "1.32"

      + access_config {
          + authentication_mode = "API"
        }

      + compute_config (known after apply)

      + control_plane_scaling_config (known after apply)

      + kubernetes_network_config (known after apply)

      + storage_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "52.154.20.199/32",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.catalog_eks.aws_eks_node_group.ordering_eks_node_group will be created
  + resource "aws_eks_node_group" "ordering_eks_node_group" {
      + ami_type               = "BOTTLEROCKET_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "catalog-eks-cluster"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "catalog-eks-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::662621393411:role/LabRole"
      + region                 = "us-east-1"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "origin" = "tc-micro-service-4/modules/eks/main.tf"
        }
      + tags_all               = {
          + "origin" = "tc-micro-service-4/modules/eks/main.tf"
        }
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + remote_access {
          + ec2_ssh_key               = "catalog_aws_key_pair"
          + source_security_group_ids = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.catalog_eks.aws_lb.app_nlb will be created
  + resource "aws_lb" "app_nlb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + dns_name                                                     = (known after apply)
      + dns_record_client_routing_policy                             = "any_availability_zone"
      + enable_cross_zone_load_balancing                             = false
      + enable_deletion_protection                                   = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = "off"
      + id                                                           = (known after apply)
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "network"
      + name                                                         = "catalog-nlb"
      + name_prefix                                                  = (known after apply)
      + region                                                       = "us-east-1"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.catalog_eks.aws_lb_listener.app_listener will be created
  + resource "aws_lb_listener" "app_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "TCP"
      + region                                                                = "us-east-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.catalog_eks.aws_lb_target_group.app_tg will be created
  + resource "aws_lb_target_group" "app_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "catalog-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-1"
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200-299"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.catalog_eks.aws_security_group.nlb_sg will be created
  + resource "aws_security_group" "nlb_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "catalog-nlb-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "name"   = "catalog-nlb-sg"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all               = {
          + "name"   = "catalog-nlb-sg"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + vpc_id                 = (known after apply)
    }

  # module.catalog_eks.aws_security_group.ordering_eks_cluster_sg will be created
  + resource "aws_security_group" "ordering_eks_cluster_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "catalog-eks-cluster-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "name"   = "catalog-eks-cluster-sg"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all               = {
          + "name"   = "catalog-eks-cluster-sg"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + vpc_id                 = (known after apply)
    }

  # module.catalog_eks.aws_security_group.ordering_eks_node_sg will be created
  + resource "aws_security_group" "ordering_eks_node_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "catalog-eks-node-"
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "name"   = "catalog-eks-node-sg"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all               = {
          + "name"   = "catalog-eks-node-sg"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + vpc_id                 = (known after apply)
    }

  # module.catalog_eks.aws_vpc_security_group_egress_rule.eks_cluster_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "eks_cluster_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "name"   = "catalog-cluster-egress"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all               = {
          + "name"   = "catalog-cluster-egress"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.aws_vpc_security_group_egress_rule.eks_node_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "eks_node_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "name"   = "catalog-node-egress"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all               = {
          + "name"   = "catalog-node-egress"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.aws_vpc_security_group_egress_rule.nlb_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "nlb_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "name"   = "catalog-nlb-egress"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all               = {
          + "name"   = "catalog-nlb-egress"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.cluster_bastion_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "cluster_bastion_ingress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "name"   = "catalog-bastion-to-cluster"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all                     = {
          + "name"   = "catalog-bastion-to-cluster"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.eks_api_public[0] will be created
  + resource "aws_vpc_security_group_ingress_rule" "eks_api_public" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "52.154.20.199/32"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "name"   = "catalog-eks-api-public"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all               = {
          + "name"   = "catalog-eks-api-public"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + to_port                = 443
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.eks_cluster_from_nodes will be created
  + resource "aws_vpc_security_group_ingress_rule" "eks_cluster_from_nodes" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "name"   = "catalog-node-cluster"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all                     = {
          + "name"   = "catalog-node-cluster"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.eks_node_ingress_self will be created
  + resource "aws_vpc_security_group_ingress_rule" "eks_node_ingress_self" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "name"   = "catalog-node-to-node"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all                     = {
          + "name"   = "catalog-node-to-node"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.eks_nodes_from_cluster will be created
  + resource "aws_vpc_security_group_ingress_rule" "eks_nodes_from_cluster" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "name"   = "catalog-cluster-to-node"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all                     = {
          + "name"   = "catalog-cluster-to-node"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.eks_nodes_nodeport_dev[0] will be created
  + resource "aws_vpc_security_group_ingress_rule" "eks_nodes_nodeport_dev" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "52.154.20.199/32"
      + from_port              = 30000
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "name"   = "catalog-nodeport-dev"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all               = {
          + "name"   = "catalog-nodeport-dev"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + to_port                = 32767
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_bastion_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "nlb_bastion_ingress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "name"   = "catalog-bastion-to-nlb"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all                     = {
          + "name"   = "catalog-bastion-to-nlb"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_cluster_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "nlb_cluster_ingress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "name"   = "catalog-cluster-to-nlb"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all                     = {
          + "name"   = "catalog-cluster-to-nlb"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_dev[0] will be created
  + resource "aws_vpc_security_group_ingress_rule" "nlb_dev" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "52.154.20.199/32"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "name"   = "catalog-nodeport-dev"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all               = {
          + "name"   = "catalog-nodeport-dev"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + to_port                = 80
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_node_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "nlb_node_ingress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "name"   = "catalog-node-to-nlb"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all                     = {
          + "name"   = "catalog-node-to-nlb"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_to_eks_cluster will be created
  + resource "aws_vpc_security_group_ingress_rule" "nlb_to_eks_cluster" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "name"   = "catalog-nlb-to-eks-cluster"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all                     = {
          + "name"   = "catalog-nlb-to-eks-cluster"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_to_node will be created
  + resource "aws_vpc_security_group_ingress_rule" "nlb_to_node" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "name"   = "catalog-nlb-to-node"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all                     = {
          + "name"   = "catalog-nlb-to-node"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.node_bastion_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "node_bastion_ingress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "name"   = "catalog-bastion-to-cluster"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
      + tags_all                     = {
          + "name"   = "catalog-bastion-to-cluster"
          + "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
    }

  # module.catalog_eks.null_resource.auto_kubeconfig_setup will be created
  + resource "null_resource" "auto_kubeconfig_setup" {
      + id       = (known after apply)
      + triggers = {
          + "access_entry"     = "arn:aws:iam::662621393411:role/voclabs"
          + "cluster_endpoint" = (known after apply)
          + "cluster_name"     = "catalog-eks-cluster"
        }
    }

  # module.catalog_k8s.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.catalog_k8s.data.aws_ecr_image.service_image will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecr_image" "service_image" {
      + id                  = (known after apply)
      + image_digest        = (known after apply)
      + image_pushed_at     = (known after apply)
      + image_size_in_bytes = (known after apply)
      + image_tag           = "latest"
      + image_tags          = (known after apply)
      + image_uri           = (known after apply)
      + region              = (known after apply)
      + registry_id         = (known after apply)
      + repository_name     = "dockerhub/catalog/jocosta96/soat-challenge"
    }

  # module.catalog_k8s.data.aws_ecr_image.service_image_by_digest will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecr_image" "service_image_by_digest" {
      + id                  = (known after apply)
      + image_digest        = (known after apply)
      + image_pushed_at     = (known after apply)
      + image_size_in_bytes = (known after apply)
      + image_tags          = (known after apply)
      + image_uri           = (known after apply)
      + region              = (known after apply)
      + registry_id         = (known after apply)
      + repository_name     = "dockerhub/catalog/jocosta96/soat-challenge"
    }

  # module.catalog_k8s.data.aws_iam_role.lab_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_role" "lab_role" {
      + arn                  = (known after apply)
      + assume_role_policy   = (known after apply)
      + create_date          = (known after apply)
      + description          = (known after apply)
      + id                   = (known after apply)
      + max_session_duration = (known after apply)
      + name                 = "LabRole"
      + path                 = (known after apply)
      + permissions_boundary = (known after apply)
      + role_last_used       = (known after apply)
      + tags                 = (known after apply)
      + unique_id            = (known after apply)
    }

  # module.catalog_k8s.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.catalog_k8s.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.catalog_k8s.data.aws_secretsmanager_secret.dockerhub_creds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_secretsmanager_secret" "dockerhub_creds" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + last_changed_date = (known after apply)
      + name              = "ecr-pullthroughcache/dockerhub-creds"
      + policy            = (known after apply)
      + region            = (known after apply)
      + tags              = (known after apply)
    }

  # module.catalog_k8s.data.aws_secretsmanager_secret_version.dockerhub_creds_version will be read during apply
  # (config refers to values not yet known)
 <= data "aws_secretsmanager_secret_version" "dockerhub_creds_version" {
      + arn            = (known after apply)
      + created_date   = (known after apply)
      + id             = (known after apply)
      + region         = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.catalog_k8s.data.http.metrics_components will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "metrics_components" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://github.com/kubernetes-sigs/metrics-server/releases/download/v0.7.2/components.yaml"
    }

  # module.catalog_k8s.aws_ecr_pull_through_cache_rule.dockerhub will be created
  + resource "aws_ecr_pull_through_cache_rule" "dockerhub" {
      + credential_arn        = (known after apply)
      + ecr_repository_prefix = "dockerhub/catalog"
      + id                    = (known after apply)
      + region                = "us-east-1"
      + registry_id           = (known after apply)
      + upstream_registry_url = "registry-1.docker.io"
    }

  # module.catalog_k8s.aws_ecr_repository_creation_template.dockerhub_template will be created
  + resource "aws_ecr_repository_creation_template" "dockerhub_template" {
      + applied_for          = [
          + "PULL_THROUGH_CACHE",
        ]
      + description          = "Settings for catalog microservice"
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + prefix               = "dockerhub/catalog"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
    }

  # module.catalog_k8s.aws_eks_addon.cloudwatch_observability will be created
  + resource "aws_eks_addon" "cloudwatch_observability" {
      + addon_name               = "amazon-cloudwatch-observability"
      + addon_version            = (known after apply)
      + arn                      = (known after apply)
      + cluster_name             = "catalog-eks-cluster"
      + configuration_values     = (known after apply)
      + created_at               = (known after apply)
      + id                       = (known after apply)
      + modified_at              = (known after apply)
      + region                   = "us-east-1"
      + service_account_role_arn = (known after apply)
      + tags_all                 = (known after apply)
    }

  # module.catalog_k8s.aws_ssm_parameter.valid_token_ssm will be created
  + resource "aws_ssm_parameter" "valid_token_ssm" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Valid token for integration"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ordering-system/catalog/basic_auth/token"
      + region         = "us-east-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.catalog_k8s.helm_release.aws_lb_controller will be created
  + resource "helm_release" "aws_lb_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "clusterName"
              + value = "catalog-eks-cluster"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "region"
              + value = "us-east-1"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "vpcId"
              + value = (known after apply)
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.create"
              + value = "true"
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "1.16.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.catalog_k8s.kubectl_manifest.app_deployment will be created
  + resource "kubectl_manifest" "app_deployment" {
      + api_version             = (known after apply)
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # module.catalog_k8s.kubectl_manifest.app_hpa will be created
  + resource "kubectl_manifest" "app_hpa" {
      + api_version             = "autoscaling/v2"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "HorizontalPodAutoscaler"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "hpa-app-catalog"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: autoscaling/v2
            kind: HorizontalPodAutoscaler
            metadata:
              name: hpa-app-catalog
            spec:
              maxReplicas: 5
              metrics:
              - resource:
                  name: cpu
                  target:
                    averageUtilization: 30
                    type: Utilization
                type: Resource
              minReplicas: 1
              scaleTargetRef:
                apiVersion: apps/v1
                kind: Deployment
                name: dpm-catalog
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.catalog_k8s.kubectl_manifest.app_secret will be created
  + resource "kubectl_manifest" "app_secret" {
      + api_version             = (known after apply)
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # module.catalog_k8s.kubectl_manifest.app_service will be created
  + resource "kubectl_manifest" "app_service" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Service"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "svc-app-lb-catalog"
      + namespace               = "default"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Service
            metadata:
              name: svc-app-lb-catalog
              namespace: default
            spec:
              ports:
              - name: http
                port: 80
                targetPort: 8080
              selector:
                app: dpm-catalog
              type: ClusterIP
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.catalog_k8s.kubectl_manifest.database_config will be created
  + resource "kubectl_manifest" "database_config" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConfigMap"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cfm-database-catalog"
      + namespace               = "default"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              DEBUG: "false"
              DRIVER_NAME: postgresql
              ENVIRONMENT: development
              LOG_LEVEL: INFO
            kind: ConfigMap
            metadata:
              name: cfm-database-catalog
              namespace: default
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.catalog_k8s.kubectl_manifest.metrics_config will be created
  + resource "kubectl_manifest" "metrics_config" {
      + api_version             = (known after apply)
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # module.catalog_k8s.kubectl_manifest.nlb_target_group_bind will be created
  + resource "kubectl_manifest" "nlb_target_group_bind" {
      + api_version             = (known after apply)
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # module.catalog_k8s.random_password.basic_auth_password will be created
  + resource "random_password" "basic_auth_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.catalog_k8s.terraform_data.ecr_cleanup will be created
  + resource "terraform_data" "ecr_cleanup" {
      + id     = (known after apply)
      + input  = {
          + image  = "jocosta96/soat-challenge"
          + prefix = "dockerhub/catalog"
        }
      + output = (known after apply)
    }

  # module.catalog_k8s.terraform_data.ecr_warmup will be created
  + resource "terraform_data" "ecr_warmup" {
      + id               = (known after apply)
      + triggers_replace = [
          + "latest",
        ]
    }

  # module.catalog_network.aws_db_subnet_group.ordering_data_subnet_group will be created
  + resource "aws_db_subnet_group" "ordering_data_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "catalog-subnet-group"
      + name_prefix             = (known after apply)
      + region                  = "us-east-1"
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + tags_all                = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + vpc_id                  = (known after apply)
    }

  # module.catalog_network.aws_internet_gateway.ordering_igw will be created
  + resource "aws_internet_gateway" "ordering_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags     = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + tags_all = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + vpc_id   = (known after apply)
    }

  # module.catalog_network.aws_route_table.ordering_private_route_table will be created
  + resource "aws_route_table" "ordering_private_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + cidr_block                 = "10.0.0.0/16"
              + gateway_id                 = "local"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + tags_all         = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + vpc_id           = (known after apply)
    }

  # module.catalog_network.aws_route_table.ordering_route_table will be created
  + resource "aws_route_table" "ordering_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
          + {
              + cidr_block                 = "10.0.0.0/16"
              + gateway_id                 = "local"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + tags_all         = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + vpc_id           = (known after apply)
    }

  # module.catalog_network.aws_route_table_association.database_route_table_association[0] will be created
  + resource "aws_route_table_association" "database_route_table_association" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.catalog_network.aws_route_table_association.database_route_table_association[1] will be created
  + resource "aws_route_table_association" "database_route_table_association" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.catalog_network.aws_route_table_association.ordering_route_table_association[0] will be created
  + resource "aws_route_table_association" "ordering_route_table_association" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.catalog_network.aws_route_table_association.ordering_route_table_association[1] will be created
  + resource "aws_route_table_association" "ordering_route_table_association" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.catalog_network.aws_subnet.database_subnet[0] will be created
  + resource "aws_subnet" "database_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.240.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + tags_all                                       = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.catalog_network.aws_subnet.database_subnet[1] will be created
  + resource "aws_subnet" "database_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.224.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + tags_all                                       = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.catalog_network.aws_subnet.ordering_subnet[0] will be created
  + resource "aws_subnet" "ordering_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + tags_all                                       = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.catalog_network.aws_subnet.ordering_subnet[1] will be created
  + resource "aws_subnet" "ordering_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + tags_all                                       = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.catalog_network.aws_vpc.ordering_vpc will be created
  + resource "aws_vpc" "ordering_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags                                 = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
      + tags_all                             = {
          + "origin" = "tc-micro-service-4/modules/network/main.tf"
        }
    }

Plan: 84 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

*Pusher: @jocosta96, Action: `pull_request`*